RestAssured_WA/testartifacts/inputXMLTemplates/GetEmployeeTemplate.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://sample.com/reservation/guest/types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:getEmployeeDetails>
         <!--Optional:-->
         <typ:employeeName>payload_employeeName</typ:employeeName>
      </typ:getEmployeeDetails>
   </soapenv:Body>
</soapenv:Envelope>